# Pandas

Pandas is a powerful data manipulation library built on top of NumPy. It provides two main data structures: Series (1D) and DataFrame (2D), which are designed for handling structured data with labeled axes.

In [ ]:
# Installing Pandas (Uncomment and run the statement below if not already installed)
# !pip install pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# Creating a Series
age = [10, 20, 30, 40, 50]
s1 = pd.Series(age, index=['a', 'b', 'c', 'd', 'e'])
s2 = pd.Series(age, index=[101, 102, 103, 104, 105])
print(s1)
print("\n")
print(s2)

a    10
b    20
c    30
d    40
e    50
dtype: int64


101    10
102    20
103    30
104    40
105    50
dtype: int64

In [ ]:
s1.loc['a':'c']

a    10
b    20
c    30
dtype: int64

In [ ]:
s2.loc[102:104]

102    20
103    30
104    40
dtype: int64

In [ ]:
# Creating a DataFrame from a dictionary

students = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ian', 'Jack'],
    'Age': [25, 30, 35, 40, 45, 28, 32, 38, 42, 29],
    'Math': [85, 90, 95, 80, 70, 88, 92, 84, 76, 89],
    'Science': [88, 92, 85, 87, 90, 91, 89, 93, 86, 88],
    'English': [90, 85, 88, 92, 80, 87, 91, 89, 84, 86]
}

# print(data)
# type(data)

df = pd.DataFrame(students)
print("\nDataFrame:\n", df)

DataFrame:
       Name  Age  Math  Science  English
0    Alice   25    85       88       90
1      Bob   30    90       92       85
2  Charlie   35    95       85       88
3    David   40    80       87       92
4      Eva   45    70       90       80
5    Frank   28    88       91       87
6    Grace   32    92       89       91
7   Hannah   38    84       93       89
8      Ian   42    76       86       84
9     Jack   29    89       88       86

In [ ]:
print("DataFrame Info:")
print(df.info())

DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     10 non-null     object
 1   Age      10 non-null     int64
 2   Math     10 non-null     int64
 3   Science  10 non-null     int64
 4   English  10 non-null     int64
dtypes: int64(4), object(1)
memory usage: 532.0+ bytes
None

In [ ]:
print("\nBasic Statistics of the Data:")
print(df.describe())

Basic Statistics of the Data:
            Age       Math    Science    English
count  10.00000  10.000000  10.000000  10.000000
mean   34.40000  84.900000  88.900000  87.200000
std     6.65332   7.680422   2.601282   3.614784
min    25.00000  70.000000  85.000000  80.000000
25%    29.25000  81.000000  87.250000  85.250000
50%    33.50000  86.500000  88.500000  87.500000
75%    39.50000  89.750000  90.750000  89.750000
max    45.00000  95.000000  93.000000  92.000000

![](https://d138zd1ktt9iqe.cloudfront.net/media/seo_landing_files/screenshot-45-1617945953.png)

In [ ]:
df.head() # First 5 rows but can be changed by passing number inside head()

      Name  Age  Math  Science  English
0    Alice   25    85       88       90
1      Bob   30    90       92       85
2  Charlie   35    95       85       88
3    David   40    80       87       92
4      Eva   45    70       90       80

In [ ]:
df.tail() # Last 5 rows but can be changed by passing number inside tail()

     Name  Age  Math  Science  English
5   Frank   28    88       91       87
6   Grace   32    92       89       91
7  Hannah   38    84       93       89
8     Ian   42    76       86       84
9    Jack   29    89       88       86

In [ ]:
df[['Name', 'Math', 'Science']]  # Selecting specific columns

      Name  Math  Science
0    Alice    85       88
1      Bob    90       92
2  Charlie    95       85
3    David    80       87
4      Eva    70       90
5    Frank    88       91
6    Grace    92       89
7   Hannah    84       93
8      Ian    76       86
9     Jack    89       88

In [ ]:
# Feature Engineering - Creating a new column 'Total' which is the sum of scores in Math, Science, and English
df['Total'] = df['Math'] + df['Science'] + df['English']
print("\nDataFrame with Total Scores:\n", df)

DataFrame with Total Scores:
       Name  Age  Math  Science  English  Total
0    Alice   25    85       88       90    263
1      Bob   30    90       92       85    267
2  Charlie   35    95       85       88    268
3    David   40    80       87       92    259
4      Eva   45    70       90       80    240
5    Frank   28    88       91       87    266
6    Grace   32    92       89       91    272
7   Hannah   38    84       93       89    266
8      Ian   42    76       86       84    246
9     Jack   29    89       88       86    263

In [ ]:
# Creating a Column of Percentages
df['Percentage'] = (df['Total'] / 300) * 100
print("\nDataFrame with Percentage Scores:\n", df)

DataFrame with Percentage Scores:
       Name  Age  Math  Science  English  Total  Percentage
0    Alice   25    85       88       90    263   87.666667
1      Bob   30    90       92       85    267   89.000000
2  Charlie   35    95       85       88    268   89.333333
3    David   40    80       87       92    259   86.333333
4      Eva   45    70       90       80    240   80.000000
5    Frank   28    88       91       87    266   88.666667
6    Grace   32    92       89       91    272   90.666667
7   Hannah   38    84       93       89    266   88.666667
8      Ian   42    76       86       84    246   82.000000
9     Jack   29    89       88       86    263   87.666667

In [ ]:
# Create a DataFrame with 5 rows and 4 columns for housing data

# import pandas as pd

# housing_data = {
#     "Location": ["Kathmandu", "Lalitpur", "Bhaktapur", "Pokhara", "Dharan"],
#     "Price": [12000000, 15000000, 9000000, 18000000, 8000000],
#     "Area_sqft": [1200, 1500, 1100, 2000, 1000],
#     "Bedrooms": [3, 4, 3, 5, 2]
# }

# housing = pd.DataFrame(housing_data)

# print(housing)
# print(housing.info())
# print(housing.describe())

### Data Selection and Filtering

**Key Methods:**
- `loc[]`: Label-based indexing
- `iloc[]`: Integer position-based indexing
- `Boolean Indexing`: Filtering based on conditions
- `query()`: SQL-like filtering
- `Column Selection`: Using brackets or dot notation

In [ ]:
employees = pd.DataFrame(
    {
        'Name': ['John', 'Anna', 'Peter', 'Linda', 'James', 'Susan', 'Robert', 'Jessica', 'Michael', 'Sarah'],
        'Age': [28, 34, 29, 42, 36, 31, 45, 27, 39, 33],
        'Department': ['HR', 'Finance', 'IT', 'Marketing', 'Sales', 'IT', 'Finance', 'HR', 'Marketing', 'Sales'],
        'Salary': [50000, 60000, 75000, 65000, 70000, 72000, 68000, 59000, 64000, 71000],
        'Experience_Years': [5, 7, 10, 6, 8, 9, 7, 4, 6, 8]
    }
)


employees

      Name  Age Department  Salary  Experience_Years
0     John   28         HR   50000                 5
1     Anna   34    Finance   60000                 7
2    Peter   29         IT   75000                10
3    Linda   42  Marketing   65000                 6
4    James   36      Sales   70000                 8
5    Susan   31         IT   72000                 9
6   Robert   45    Finance   68000                 7
7  Jessica   27         HR   59000                 4
8  Michael   39  Marketing   64000                 6
9    Sarah   33      Sales   71000                 8

In [ ]:
# loc-label based indexing
employees.loc[0:2]

    Name  Age Department  Salary  Experience_Years
0   John   28         HR   50000                 5
1   Anna   34    Finance   60000                 7
2  Peter   29         IT   75000                10

In [ ]:
# loc-label based indexing
# employees.loc[2:5, 'Name':'Department'] # For rows from index 2 through 5 and columns from Name to Department
employees.loc[2:5, ['Name', 'Experience_Years', 'Department', 'Salary']]

    Name  Experience_Years Department  Salary
2  Peter                10         IT   75000
3  Linda                 6  Marketing   65000
4  James                 8      Sales   70000
5  Susan                 9         IT   72000

In [ ]:
# iloc-based indexing
employees.iloc[2:7]

     Name  Age Department  Salary  Experience_Years
2   Peter   29         IT   75000                10
3   Linda   42  Marketing   65000                 6
4   James   36      Sales   70000                 8
5   Susan   31         IT   72000                 9
6  Robert   45    Finance   68000                 7

In [ ]:
# iloc-based indexing
print("First 3 rows and first 2 columns")
employees.iloc[0:3, 0:2]

First 3 rows and first 2 columns

    Name  Age
0   John   28
1   Anna   34
2  Peter   29

In [ ]:
# Boolean Indexing
# Employees in the IT Department
condition = (employees['Department'] == 'IT')
print(condition)
employees[condition]

# employees[employees['Department] == 'IT']

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: Department, dtype: bool

    Name  Age Department  Salary  Experience_Years
2  Peter   29         IT   75000                10
5  Susan   31         IT   72000                 9

In [ ]:
# Multiple Conditions
# Employees in the IT Department whose age is below 30
condition2 = (employees['Department'] == 'IT') & (employees['Age'] <= 30)
print(condition2)
employees[condition2]

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

    Name  Age Department  Salary  Experience_Years
2  Peter   29         IT   75000                10

In [ ]:
# condition3 = (employees['Salary'] > 70000) & (employees['Experience_Years'] < 9)
# employees[condition3]

employees[(employees['Salary']>70000) & (employees['Experience_Years']<9)]

    Name  Age Department  Salary  Experience_Years
9  Sarah   33      Sales   71000                 8

In [ ]:
condition4 = (employees['Age']>40) | (employees['Experience_Years']>=9)
print(condition4)
top_emp = employees[condition4].copy()
top_emp

0    False
1    False
2     True
3     True
4    False
5     True
6     True
7    False
8    False
9    False
dtype: bool

     Name  Age Department  Salary  Experience_Years
2   Peter   29         IT   75000                10
3   Linda   42  Marketing   65000                 6
5   Susan   31         IT   72000                 9
6  Robert   45    Finance   68000                 7

In [ ]:
# Using query()
employees.query('Salary > 70000 and Experience_Years < 9')

    Name  Age Department  Salary  Experience_Years
9  Sarah   33      Sales   71000                 8

In [ ]:
# Assignments:
# Create a DataFrame with 100 rows of random student data including: ID, Name, GPA, and Major
# Select rows where GPA is between 3.1-3.8 OR Major is 'Computer Science'

### Data Cleaning and Handling Missing Values

In [ ]:
df_miss = pd.DataFrame(
    {
        'A': [1, 2, np.nan, 4, 5],
        'B': [np.nan, 2, 3, 4, np.nan],
        'C': [1, np.nan, np.nan, 4, 5],
        'D': ['x', 'y', 'x', np.nan, 'z'],
        'E': [1, 2, 3, 4, 5]
    }
)

df_miss

     A    B    C    D  E
0  1.0  NaN  1.0    x  1
1  2.0  2.0  NaN    y  2
2  NaN  3.0  NaN    x  3
3  4.0  4.0  4.0  NaN  4
4  5.0  NaN  5.0    z  5

In [ ]:
df_miss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       3 non-null      float64
 2   C       3 non-null      float64
 3   D       4 non-null      object
 4   E       5 non-null      int64
dtypes: float64(3), int64(1), object(1)
memory usage: 332.0+ bytes

In [ ]:
# df_miss.isnull()
print("Counting the missing values in each column:")
df_miss.isna().sum()
# df_miss.isnull().sum()
# df_miss.notnull().sum()

Counting the missing values in each column:

A    1
B    2
C    2
D    1
E    0
dtype: int64

In [ ]:
# Drop Rows with Missing Values
# df_dropped_rows = df_miss.dropna()
# df_miss.dropna(inplace=True) # This will drop rows with any missing values in the actual DataFrame
df_miss.dropna()

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [ ]:
# Drop Columns with Missing Values
# df_dropped_cols = df_miss.dropna(axis=1)
df_miss.dropna(axis=1)

   E
0  1
1  2
2  3
3  4
4  5

In [ ]:
# Fill the missing values with a specific value, e.g., 0
# df_filled = df_miss.fillna(0)
# df_miss.fillna(0, inplace=True) # This will fill missing values in the actual DataFrame
df_miss.fillna(0)

     A    B    C  D  E
0  1.0  0.0  1.0  x  1
1  2.0  2.0  0.0  y  2
2  0.0  3.0  0.0  x  3
3  4.0  4.0  4.0  0  4
4  5.0  0.0  5.0  z  5

In [ ]:
A_mean = df_miss['A'].mean()
print("Mean of column A: ", A_mean)
df_miss['A1'] = df_miss['A'].fillna(A_mean)
df_miss

Mean of column A:  3.0

     A    B    C    D  E   A1
0  1.0  NaN  1.0    x  1  1.0
1  2.0  2.0  NaN    y  2  2.0
2  NaN  3.0  NaN    x  3  3.0
3  4.0  4.0  4.0  NaN  4  4.0
4  5.0  NaN  5.0    z  5  5.0

In [ ]:
# Replace NaN in column 'B' with the median of that column

B_median = df_miss['B'].median()
print("Median of column B: ", B_median)
df_miss['B1'] = df_miss['B']. fillna(B_median)
df_miss

Median of column B:  3.0

     A    B    C    D  E   A1   B1
0  1.0  NaN  1.0    x  1  1.0  3.0
1  2.0  2.0  NaN    y  2  2.0  2.0
2  NaN  3.0  NaN    x  3  3.0  3.0
3  4.0  4.0  4.0  NaN  4  4.0  4.0
4  5.0  NaN  5.0    z  5  5.0  3.0

In [ ]:
C_median = df_miss['C'].median()
print("Median of column C: ", C_median)
df_miss['C1'] = df_miss['C']. fillna(C_median)
df_miss

Median of column C:  4.0

     A    B    C    D  E   A1   B1   C1
0  1.0  NaN  1.0    x  1  1.0  3.0  1.0
1  2.0  2.0  NaN    y  2  2.0  2.0  4.0
2  NaN  3.0  NaN    x  3  3.0  3.0  4.0
3  4.0  4.0  4.0  NaN  4  4.0  4.0  4.0
4  5.0  NaN  5.0    z  5  5.0  3.0  5.0

In [ ]:
# D_mode = df_miss['D'].mode()[0]
# D_mode

In [ ]:
D_mode = df_miss['D'].mode()[0]
print("Mode of column D: ", D_mode)
df_miss['D1'] = df_miss['D'].fillna(D_mode)
df_miss

Mode of column D:  x

     A    B    C    D  E   A1   B1   C1 D1
0  1.0  NaN  1.0    x  1  1.0  3.0  1.0  x
1  2.0  2.0  NaN    y  2  2.0  2.0  4.0  y
2  NaN  3.0  NaN    x  3  3.0  3.0  4.0  x
3  4.0  4.0  4.0  NaN  4  4.0  4.0  4.0  x
4  5.0  NaN  5.0    z  5  5.0  3.0  5.0  z

In [ ]:
# df_miss.fillna(df_miss.median()) # Fill NaN with mean of each column when all columns are numeric

![](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSqHeovNQftfl__IO4xUiampIiULlTdAj64hQ&s)

In [ ]:
# salary = [20000, 25000, 30000, 35000, 400000]
# avg_salary = sum(salary)/len(salary)
# avg_salary

In [ ]:
# Fill missing values with forward fill and backward fill method
df_miss.ffill() # This fills NaN with the last known value
# df_miss.bfill() # This fills NaN with the next known value
# df_miss

# df_miss.fillna(method='ffill')
# df_miss.fillna(method='bfill')

     A    B    C  D  E   A1   B1   C1 D1
0  1.0  NaN  1.0  x  1  1.0  3.0  1.0  x
1  2.0  2.0  1.0  y  2  2.0  2.0  4.0  y
2  2.0  3.0  1.0  x  3  3.0  3.0  4.0  x
3  4.0  4.0  4.0  x  4  4.0  4.0  4.0  x
4  5.0  4.0  5.0  z  5  5.0  3.0  5.0  z

In [ ]:
df_dups = pd.DataFrame(
    {
        'A': [1, 2, 2, 4, 5, 1, 2],
        'B': ['x', 'y', 'y', 'z', 'x', 'z', 'y'],
        'C': [10, 20, 20, 30, 40, 10, 20]
    }
)

df_dups

   A  B   C
0  1  x  10
1  2  y  20
2  2  y  20
3  4  z  30
4  5  x  40
5  1  z  10
6  2  y  20

In [ ]:
# Check if there are duplicate rows
# df_dups.duplicated() # Prints a boolean Series indicating duplicate rows
df_dups[['A', 'C']].duplicated()
# df_dups.duplicated().sum()

0    False
1    False
2     True
3    False
4    False
5     True
6     True
dtype: bool

In [ ]:
df_dups.drop_duplicates()

   A  B   C
0  1  x  10
1  2  y  20
3  4  z  30
4  5  x  40
5  1  z  10

In [ ]:
# Check the size/number of columns of DataFrame after removing duplicates
print(f"Initial number of rows: {len(df_dups)}, After removing duplicates: {len(df_dups.drop_duplicates())}.")

Initial number of rows: 7, After removing duplicates: 5.

In [ ]:
# df_dups.shape # Get the shape of the DataFrame (rows, columns)
df_dups.columns # Get the column names of the DataFrame

Index(['A', 'B', 'C'], dtype='object')

![](https://www.researchgate.net/publication/361458577/figure/fig1/AS:1169650368942082@1655877787592/QR-method-to-detect-outliers-2.ppm)

In [ ]:
# Detecting and Replacing the Outliers with the median value of the column using IQR method

df_out = pd.DataFrame(
    {
        'Values': [10, 12, 14, 13, 15, 1000, 16, 14, 13, 12, 11, -999]
    }
)

df_out

    Values
0       10
1       12
2       14
3       13
4       15
5     1000
6       16
7       14
8       13
9       12
10      11
11    -999

In [ ]:
def df_replace_outliers_iqr(df, column):
    Q1 = df[column].quantile(0.25)
    Q3 = df[column].quantile(0.75)
    IQR = Q3 - Q1
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR

    median_value = df[column].median()
    print(f"Lower Bound: {lower_bound}, Upper Bound: {upper_bound}, Median: {median_value}" )
    # The two lines below delete the rows with outliers
    # condition = (df[column] >= lower_bound) & (df[column] <= upper_bound)
    # df[condition]

    # The line below replaces outliers with the median value
    condition = (df[column] < lower_bound) | (df[column] > upper_bound)
    df.loc[condition, column] = median_value
    return df

In [ ]:
print(f"Size of Original DataFrame: {len(df_out)}")
df_out_cleaned = df_replace_outliers_iqr(df_out, 'Values')
print(f"Size of Cleaned DataFrame: {len(df_out_cleaned)}")
df_out_cleaned

Size of Original DataFrame: 12
Lower Bound: 8.0, Upper Bound: 18.0, Median: 13.0
Size of Cleaned DataFrame: 12

    Values
0       10
1       12
2       14
3       13
4       15
5       13
6       16
7       14
8       13
9       12
10      11
11      13

### Data Aggregation and Grouping

Grouping and aggregation are essential for summarizing data, calculating statistics by category, etc.

***Key Methods:***
* groupby()
* agg()
* transform()
* pivot_table()
* crosstab()

In [ ]:
# Sample Sales DataFrame for Grouping and Aggregation

sales_data = {
    'Date': pd.date_range(start='2025-01-01', periods=10, freq='ME'),
    'Salesperson': ['Alice', 'Bob', 'Alice', 'David', 'Bob', 'Eva', 'David', 'Alice', 'Eva', 'Bob'],
    'Region': ['North', 'South', 'East', 'West', 'North', 'East', 'South', 'West', 'North', 'East'],
    'Product': ['A', 'B', 'A', 'C', 'B', 'A', 'C', 'A', 'B', 'C'],
    'Amount': [5000, 7000, 6000, 8000, 7500, 6500, 7200, 5800, 6900, 7100],
    'Quantity': [50, 70, 60, 80, 75, 65, 72, 58, 69, 71]
}

sales_df = pd.DataFrame(sales_data)
sales_df

        Date Salesperson Region Product  Amount  Quantity
0 2025-01-31       Alice  North       A    5000        50
1 2025-02-28         Bob  South       B    7000        70
2 2025-03-31       Alice   East       A    6000        60
3 2025-04-30       David   West       C    8000        80
4 2025-05-31         Bob  North       B    7500        75
5 2025-06-30         Eva   East       A    6500        65
6 2025-07-31       David  South       C    7200        72
7 2025-08-31       Alice   West       A    5800        58
8 2025-09-30         Eva  North       B    6900        69
9 2025-10-31         Bob   East       C    7100        71

In [ ]:
# sales_by_person = sales_df.groupby('Salesperson')[['Amount', 'Quantity']].sum().reset_index()
# Group by Salesperson and calculate total sales amount
sales_by_person = sales_df.groupby('Salesperson')['Amount'].sum().reset_index()
sales_by_person

  Salesperson  Amount
0       Alice   16800
1         Bob   21600
2       David   15200
3         Eva   13400

In [ ]:
# Group by Region and calculate average sales amount
avg_sales_by_region = sales_df.groupby('Region')['Amount'].mean().reset_index()
avg_sales_by_region

  Region       Amount
0   East  6533.333333
1  North  6466.666667
2  South  7100.000000
3   West  6900.000000

In [ ]:
# Multiple Aggregations
sales_agg = sales_df.groupby('Salesperson')['Amount'].agg(['mean', 'sum', 'max', 'min', 'count']).reset_index()
sales_agg

  Salesperson    mean    sum   max   min  count
0       Alice  5600.0  16800  6000  5000      3
1         Bob  7200.0  21600  7500  7000      3
2       David  7600.0  15200  8000  7200      2
3         Eva  6700.0  13400  6900  6500      2

In [ ]:
sales_df.groupby('Salesperson')['Amount'].agg(['mean', 'sum', 'max', 'min', 'count'])

               mean    sum   max   min  count
Salesperson
Alice        5600.0  16800  6000  5000      3
Bob          7200.0  21600  7500  7000      3
David        7600.0  15200  8000  7200      2
Eva          6700.0  13400  6900  6500      2

In [ ]:
# Different Aggregations for Different Columns
sales_custom_agg = sales_df.groupby('Salesperson').agg({
    'Amount' : ['mean', 'max', 'min', 'count'],
    'Quantity' : ['max', 'min']
}).reset_index()

sales_custom_agg

  Salesperson  Amount                   Quantity
                 mean   max   min count      max min
0       Alice  5600.0  6000  5000     3       60  50
1         Bob  7200.0  7500  7000     3       75  70
2       David  7600.0  8000  7200     2       80  72
3         Eva  6700.0  6900  6500     2       69  65

In [ ]:
# Group by Multiple Columns and calculate total sales amount
sales_by_region_product = sales_df.groupby(['Region', 'Product'])['Amount'].mean().reset_index()
sales_by_region_product

  Region Product  Amount
0   East       A  6250.0
1   East       C  7100.0
2  North       A  5000.0
3  North       B  7200.0
4  South       B  7000.0
5  South       C  7200.0
6   West       A  5800.0
7   West       C  8000.0

In [ ]:
sales_df

        Date Salesperson Region Product  Amount  Quantity
0 2025-01-31       Alice  North       A    5000        50
1 2025-02-28         Bob  South       B    7000        70
2 2025-03-31       Alice   East       A    6000        60
3 2025-04-30       David   West       C    8000        80
4 2025-05-31         Bob  North       B    7500        75
5 2025-06-30         Eva   East       A    6500        65
6 2025-07-31       David  South       C    7200        72
7 2025-08-31       Alice   West       A    5800        58
8 2025-09-30         Eva  North       B    6900        69
9 2025-10-31         Bob   East       C    7100        71

In [ ]:
sales_pivot = sales_df.pivot_table(
    values='Amount',
    index='Region',
    columns='Product',
    aggfunc='mean',
    fill_value=0
)
sales_pivot

Product       A       B       C
Region
East     6250.0     0.0  7100.0
North    5000.0  7200.0     0.0
South       0.0  7000.0  7200.0
West     5800.0     0.0  8000.0

In [ ]:
sales_pivot1 = sales_df.pivot_table(
    values=['Amount', 'Quantity'],
    index='Region',
    columns='Product',
    aggfunc='mean',
    fill_value=0
)
sales_pivot1

         Amount                 Quantity
Product       A       B       C        A     B     C
Region
East     6250.0     0.0  7100.0     62.5   0.0  71.0
North    5000.0  7200.0     0.0     50.0  72.0   0.0
South       0.0  7000.0  7200.0      0.0  70.0  72.0
West     5800.0     0.0  8000.0     58.0   0.0  80.0

In [ ]:
crosstab = pd.crosstab(
    index=sales_df['Region'],
    columns=sales_df['Product'],
    values=sales_df['Amount'],
    aggfunc='count'
).fillna(0)
crosstab

Product    A    B    C
Region
East     2.0  0.0  1.0
North    1.0  2.0  0.0
South    0.0  1.0  1.0
West     1.0  0.0  1.0

### Reading and Exporting Data in Multiple Formats

In [ ]:
sales_df

# sales_df.to_csv('./data/sales_data.csv', index=False)  # Save DataFrame to CSV file without index

# !pip install openpyxl
# sales_df.to_excel('./data/sales_data.xlsx', index=False)  # Save DataFrame to Excel

        Date Salesperson Region Product  Amount  Quantity
0 2025-01-31       Alice  North       A    5000        50
1 2025-02-28         Bob  South       B    7000        70
2 2025-03-31       Alice   East       A    6000        60
3 2025-04-30       David   West       C    8000        80
4 2025-05-31         Bob  North       B    7500        75
5 2025-06-30         Eva   East       A    6500        65
6 2025-07-31       David  South       C    7200        72
7 2025-08-31       Alice   West       A    5800        58
8 2025-09-30         Eva  North       B    6900        69
9 2025-10-31         Bob   East       C    7100        71

In [ ]:
df_eve = pd.read_csv('./data/sales_data.csv')

In [ ]:
# Common Data Sources: Kaggle, UCI Machine Learning Repository, Government Open Data Portals, World Bank Data, Google Dataset Search, GitHub

# url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data'

# wine = pd.read_csv(url, header=None)

# wine.columns = ['Class','Alcohol','Malic_acid','Ash','Alcalinity_of_ash','Magnesium','Total_phenols','Flavanoids','Nonflavanoid_phenols','Proanthocyanins','Color_intensity','Hue','OD280/OD315_of_diluted_wines','Proline']
# wine

In [ ]:
# wine.to_csv('./data/wine_data.csv', index=False)

In [ ]:
wine = pd.read_csv('./data/wine_data.csv')

wine.head()

,Class,Alcohol,Malic_acid,Ash,Alcalinity_of_ash,Magnesium,Total_phenols,Flavanoids,Nonflavanoid_phenols,Proanthocyanins,Color_intensity,Hue,OD280/OD315_of_diluted_wines,Proline
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [ ]:
# For web scraping of data from HTML tables
# !pip install beautifulsoup4 html5lib lxml

In [ ]:
# Reading HTML tables from a webpage

# html_url = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'


# tables = pd.read_html(html_url)
# print(f"Number of tables found: {len(tables)}")

# tables[0]

In [ ]:
# Reading HTML Tables from a Webpage containing specific matching words

# tables2 = pd.read_html(html_url, match='Bank', header=0)
# tables2[0]

# tables2[0].to_csv('./data/failed_banks.csv', index=False)

### Merging and Joining DataFrame

**Key Methods:**
- merge(): SQL-style joins (inner, outer, left, right)
- concat(): Concatenate along rows and columns

![](https://miro.medium.com/1*9eH1_7VbTZPZd9jBiGIyNA.png)

In [ ]:
customers = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'John', 'Eva'],
    'Email': ['alice@gmail.com', 'bob@gmail.com', 'charlie@gmail.com', 'john@gmail.com', 'eva@gmail.com']
})

orders = pd.DataFrame({
    'OrderID': [101, 102, 103, 104, 105],
    'Customer': [1, 2, 2, 3, 5],
    'Product': ['Laptop', 'Smartphone', 'Tablet', 'Headphones', 'Smartwatch'],
    'Amount': [1200, 800, 300, 150, 400]
})

In [ ]:
customers

   CustomerID     Name              Email
0           1    Alice    alice@gmail.com
1           2      Bob      bob@gmail.com
2           3  Charlie  charlie@gmail.com
3           4     John     john@gmail.com
4           5      Eva      eva@gmail.com

In [ ]:
orders

   OrderID  Customer     Product  Amount
0      101         1      Laptop    1200
1      102         2  Smartphone     800
2      103         2      Tablet     300
3      104         3  Headphones     150
4      105         5  Smartwatch     400

In [ ]:
# left_on and right_on are used when the column names to join on are different in the two DataFrames
# when the column names are same in both DataFrames, we can use 'on' parameter directly
innerjoin = pd.merge(customers, orders, left_on='CustomerID', right_on='Customer', how='inner')
innerjoin

,CustomerID,Name,Email,OrderID,Customer,Product,Amount
0,1,Alice,alice@gmail.com,101,1,Laptop,1200
1,2,Bob,bob@gmail.com,102,2,Smartphone,800
2,2,Bob,bob@gmail.com,103,2,Tablet,300
3,3,Charlie,charlie@gmail.com,104,3,Headphones,150
4,5,Eva,eva@gmail.com,105,5,Smartwatch,400

In [ ]:
leftjoin = pd.merge(customers, orders, on='CustomerID', how='left')
leftjoin

   CustomerID     Name              Email  OrderID     Product  Amount
0           1    Alice    alice@gmail.com    101.0      Laptop  1200.0
1           2      Bob      bob@gmail.com    102.0  Smartphone   800.0
2           2      Bob      bob@gmail.com    103.0      Tablet   300.0
3           3  Charlie  charlie@gmail.com    104.0  Headphones   150.0
4           4     John     john@gmail.com      NaN         NaN     NaN
5           5      Eva      eva@gmail.com    105.0  Smartwatch   400.0

In [ ]:
outerjoin = pd.merge(customers, orders, on='CustomerID', how='outer')
outerjoin

   CustomerID     Name              Email  OrderID     Product  Amount
0           1    Alice    alice@gmail.com    101.0      Laptop  1200.0
1           2      Bob      bob@gmail.com    102.0  Smartphone   800.0
2           2      Bob      bob@gmail.com    103.0      Tablet   300.0
3           3  Charlie  charlie@gmail.com    104.0  Headphones   150.0
4           4     John     john@gmail.com      NaN         NaN     NaN
5           5      Eva      eva@gmail.com    105.0  Smartwatch   400.0

In [ ]:
customers2 = pd.DataFrame({
    'CustomerID': [6, 7],
    'Name': ['Frank', 'Ben'],
    'Email': ['frank@gmail.com', 'ben@outlook.com']
})

customers2

   CustomerID   Name            Email
0           6  Frank  frank@gmail.com
1           7    Ben  ben@outlook.com

In [ ]:
# Vertical Concatenations
vertical = pd.concat([customers, customers2], ignore_index=True)
vertical

   CustomerID     Name              Email
0           1    Alice    alice@gmail.com
1           2      Bob      bob@gmail.com
2           3  Charlie  charlie@gmail.com
3           4     John     john@gmail.com
4           5      Eva      eva@gmail.com
5           6    Frank    frank@gmail.com
6           7      Ben    ben@outlook.com

In [ ]:
# Horizontal Concatenations (not relevant in this scenario but shown for demonstration only)
horizontal = pd.concat([customers, customers2], axis=1)
horizontal

   CustomerID     Name              Email  CustomerID   Name            Email
0           1    Alice    alice@gmail.com         6.0  Frank  frank@gmail.com
1           2      Bob      bob@gmail.com         7.0    Ben  ben@outlook.com
2           3  Charlie  charlie@gmail.com         NaN    NaN              NaN
3           4     John     john@gmail.com         NaN    NaN              NaN
4           5      Eva      eva@gmail.com         NaN    NaN              NaN

In [ ]:
# Topics for Next Class: Matplotlib Basic and Advanced Charts